БукмекерскаяКонтора/src/Documents/СнятиеСДепозита/СнятиеСДепозита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СнятиеСДепозита</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСнятия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/AccumulationRegisters/Депозиты/Депозиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Депозиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/Documents/СнятиеСДепозита/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Депозиты.Записывать = Истина;
	Движение = Движения.Депозиты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Игрок = Игрок;
	Движение.Сумма = СуммаСнятия;
КонецПроцедуры
